coffee/app/views/categories/show.html.erb

<h3>ЧАТ:</h3>
<% @category.masseges.each do |massege|%>
---
SELECT "masseges".* FROM "masseges" WHERE "masseges"."category_id" = ?  [["category_id", 2]]