coffee/app/views/recipes/show.html.erb

<div class="comment">
<% @recipe.comments.each do |comment|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = ?  [["recipe_id", 21]]