coffee/app/controllers/comments_controller.rb

    def create
      @recipe=Recipe.find(params[:recipe_id])
      @comment=@recipe.comments.create(comment_params)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "body", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "0102032306a@gmail.com"], ["body", "csks"], ["recipe_id", 21], ["created_at", "2020-12-13 14:57:37.061205"], ["updated_at", "2020-12-13 14:57:37.061205"]]