coffee/app/controllers/masseges_controller.rb

        def create
            @category = Category.find(params[:category_id])
            @massege=@category.masseges.create(massege_params)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "masseges" ("author", "body", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?)  [["author", "Настя"], ["body", "сомвто"], ["created_at", "2020-12-13 11:35:23.134021"], ["updated_at", "2020-12-13 11:35:23.134021"], ["category_id", 1]]