coffee/app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "recipes"
---
    def index
        @recipes=Recipe.paginate(page: params[:page], per_page: 5)

INSERT INTO "recipes" ("title", "summary", "body", "created_at", "updated_at", "author", "method") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @recipe = Recipe.new(recipe_params)
        @recipe.author=current_user.email
        if @recipe.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
UPDATE "recipes" SET "body" = ?, "updated_at" = ? WHERE "recipes"."id" = ?
---
    def update
        @recipe = Recipe.find(params[:id])
        if @recipe.update_attributes(recipe_params)

SELECT "recipes".* FROM "recipes" WHERE (method = 'турка')
---
    def result
        respond_to do |format|
            format.html { @recipes = Recipe.where("method = ?", params[:method]) }